<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"f4718c6accd9805b48879ee7604164bbe93d019b01d6e234a663fd0b5aa71a00","plan_job_ref":"Job Create MPE Management terraform plan #20 at https://github.com/AFMPE/mpe_management/actions/runs/4756693636","plan_hash":"a90706367b5514bab3060b4ff6d942aa97f77982a5582812d3d9c6d33745b85d","plan_text_format":"trunc","version":"99.0.0"} -->
Terraform plan in __src__
With var files: `src/tfvars/production/deploy.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_hub               = "7eb60145-02f2-4fc1-80d2-e25d2ce9e45d"
subscription_id_internal          = "96320317-c02c-4dd7-9284-272947c7be25"
subscription_id_partners_gsa_dev  = "65798e1e-c177-4373-ac3b-921f11f737c8"
subscription_id_partners_gsa_prod = "8e7d8532-99d3-4348-837d-94eb765b2344"
subscription_id_sandbox           = "6de24b6c-e2f1-4cad-a222-3512b49eeb49"
```
</details>
<details>
<summary>Plan: 94 to add, 0 to change, 0 to destroy.</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.landing_zone.azurerm_linux_virtual_machine.bastion_jumpbox_vm[0] will be created
  + resource "azurerm_linux_virtual_machine" "bastion_jumpbox_vm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "ampe-eus-hub-core-prod-bas-vm"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "ampe-eus-hub-core-prod-rg"
      + size                            = "Standard_F2"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }
    }

  # module.landing_zone.azurerm_network_interface.bastion_jumpbox_nic[0] will be created
  + resource "azurerm_network_interface" "bastion_jumpbox_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ampe-eus-hub-core-prod-bas-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-hub-core-prod-rg"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "bastion-jumpbox-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.management_groups.time_sleep.after_azurerm_management_group will be created
  + resource "time_sleep" "after_azurerm_management_group" {
      + create_duration  = "30s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "azurerm_management_group" = jsonencode(
                [
                  + "management_groups",
                ]
            )
        }
    }

  # module.landing_zone.module.mod_hub_network.data.azurenoopsutils_resource_name.st will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "st" {
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.landing_zone.module.mod_hub_network.azurerm_bastion_host.main[0] will be created
  + resource "azurerm_bastion_host" "main" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "ampe-eus-hub-core-prod-bast"
      + resource_group_name    = "ampe-eus-hub-core-prod-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "ResourceName" = "ampe-eus-hub-core-prod-bast"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "ampe-eus-hub-core-prod-bast-network"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall.fw[0] will be created
  + resource "azurerm_firewall" "fw" {
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-prod-fw"
      + resource_group_name = "ampe-eus-hub-core-prod-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Premium"
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-prod-fw"
        }
      + threat_intel_mode   = "Alert"

      + ip_configuration {
          + name                 = "ampe-eus-hub-core-prod-fw-ipconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "ampe-eus-hub-core-prod-fw-forced-tunnel"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy.firewallpolicy will be created
  + resource "azurerm_firewall_policy" "firewallpolicy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "ampe-eus-hub-core-prod-afwp"
      + resource_group_name      = "ampe-eus-hub-core-prod-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Premium"
      + threat_intelligence_mode = "Alert"

      + intrusion_detection {
          + mode = "Alert"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.app_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "app_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-prod-afwp-default-arcg"
      + priority           = 300

      + application_rule_collection {
          + action   = "Allow"
          + name     = "AzureAuth"
          + priority = 110

          + rule {
              + destination_fqdns = [
                  + "aadcdn.msftauth.net",
                  + "aadcdn.msauth.net",
                ]
              + name              = "msftauth"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nat_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "nat_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-prod-afwp-default-natrcg"
      + priority           = 110
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nw_rule_collection_group will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "nw_rule_collection_group" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "ampe-eus-hub-core-prod-afwp-default-nwrcg"
      + priority           = 100

      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowAzureCloud"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "AzureCloud",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "AzureCloud"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowTrafficBetweenSpokes"
          + priority = 200

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "AllSpokeTraffic"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.0.96.0/19",
                ]
            }
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-prod-nsg"
      + resource_group_name = "ampe-eus-hub-core-prod-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "DeployedBy" = "AzureNoOpsTF [default]"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_network_watcher.nwatcher[0] will be created
  + resource "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = {
          + "ResourceName" = "NetworkWatcher_eastus"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone.privatelink_agentsvc_azure_automation_net will be created
  + resource "azurerm_private_dns_zone" "privatelink_agentsvc_azure_automation_net" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.agentsvc.azure-automation.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "ampe-eus-hub-core-prod-rg"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone.privatelink_blob_core_cloudapi_net will be created
  + resource "azurerm_private_dns_zone" "privatelink_blob_core_cloudapi_net" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "ampe-eus-hub-core-prod-rg"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone.privatelink_monitor_azure_com will be created
  + resource "azurerm_private_dns_zone" "privatelink_monitor_azure_com" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.monitor.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "ampe-eus-hub-core-prod-rg"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone.privatelink_ods_opinsights_azure_com will be created
  + resource "azurerm_private_dns_zone" "privatelink_ods_opinsights_azure_com" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.ods.opinsights.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "ampe-eus-hub-core-prod-rg"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone.privatelink_oms_opinsights_azure_com will be created
  + resource "azurerm_private_dns_zone" "privatelink_oms_opinsights_azure_com" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.oms.opinsights.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "ampe-eus-hub-core-prod-rg"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone_virtual_network_link.privateDnsZones_privatelink_blob_core_cloudapi_net_privateDnsZones_privatelink_blob_core_cloudapi_net_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privateDnsZones_privatelink_blob_core_cloudapi_net_privateDnsZones_privatelink_blob_core_cloudapi_net_link" {
      + id                    = (known after apply)
      + name                  = "ampe-eus-hub-core-prod-vnet-privatelink.blob.core.windows.net-link"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "ampe-eus-hub-core-prod-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone_virtual_network_link.privatelink_agentsvc_azure_automation_net_privatelink_agentsvc_azure_automation_net_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privatelink_agentsvc_azure_automation_net_privatelink_agentsvc_azure_automation_net_link" {
      + id                    = (known after apply)
      + name                  = "ampe-eus-hub-core-prod-vnet-privatelink.agentsvc.azure-automation.net-link"
      + private_dns_zone_name = "privatelink.agentsvc.azure-automation.net"
      + registration_enabled  = false
      + resource_group_name   = "ampe-eus-hub-core-prod-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone_virtual_network_link.privatelink_monitor_azure_com_privatelink_monitor_azure_com_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privatelink_monitor_azure_com_privatelink_monitor_azure_com_link" {
      + id                    = (known after apply)
      + name                  = "ampe-eus-hub-core-prod-vnet-privatelink.monitor.azure.com-link"
      + private_dns_zone_name = "privatelink.monitor.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "ampe-eus-hub-core-prod-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone_virtual_network_link.privatelink_ods_opinsights_azure_com_privatelink_ods_opinsights_azure_com_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privatelink_ods_opinsights_azure_com_privatelink_ods_opinsights_azure_com_link" {
      + id                    = (known after apply)
      + name                  = "ampe-eus-hub-core-prod-vnet-privatelink.ods.opinsights.azure.com-link"
      + private_dns_zone_name = "privatelink.ods.opinsights.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "ampe-eus-hub-core-prod-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_private_dns_zone_virtual_network_link.privatelink_oms_opinsights_azure_com_privatelink_oms_opinsights_azure_com_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "privatelink_oms_opinsights_azure_com_privatelink_oms_opinsights_azure_com_link" {
      + id                    = (known after apply)
      + name                  = "ampe-eus-hub-core-prod-vnet-privatelink.oms.opinsights.azure.com-link"
      + private_dns_zone_name = "privatelink.oms.opinsights.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "ampe-eus-hub-core-prod-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_public_ip.bastion_pip[0] will be created
  + resource "azurerm_public_ip" "bastion_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-prod-bas-pip"
      + resource_group_name     = "ampe-eus-hub-core-prod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "ResourceName" = "ampe-eus-hub-core-prod-bas-pip"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_public_ip.firewall_client_pip[0] will be created
  + resource "azurerm_public_ip" "firewall_client_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-prod-fw-client-pip"
      + resource_group_name     = "ampe-eus-hub-core-prod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_public_ip.firewall_management_pip[0] will be created
  + resource "azurerm_public_ip" "firewall_management_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "ampe-eus-hub-core-prod-fw-management-pip"
      + resource_group_name     = "ampe-eus-hub-core-prod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_public_ip_prefix.fw-pref[0] will be created
  + resource "azurerm_public_ip_prefix" "fw-pref" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-prod-fw-prefix"
      + prefix_length       = 30
      + resource_group_name = "ampe-eus-hub-core-prod-rg"
      + sku                 = "Standard"
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-prod-fw-prefix"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_resource_group.nwatcher[0] will be created
  + resource "azurerm_resource_group" "nwatcher" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "NetworkWatcherRG"
      + tags     = {
          + "ResourceName" = "NetworkWatcherRG"
        }
    }

  # module.landing_zone.module.mod_hub_network.azurerm_route.force_internet_tunneling[0] will be created
  + resource "azurerm_route" "force_internet_tunneling" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "InternetForceTunneling"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ampe-eus-hub-core-prod-rg"
      + route_table_name       = "ampe-eus-hub-core-prod-route"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_route_table.routetable will be created
  + resource "azurerm_route_table" "routetable" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "ampe-eus-hub-core-prod-route"
      + resource_group_name           = "ampe-eus-hub-core-prod-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_storage_account.storeacc will be created
  + resource "azurerm_storage_account" "storeacc" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "*******"
      + resource_group_name               = "ampe-eus-hub-core-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "*******"
      + tags                              = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet.abs_snet[0] will be created
  + resource "azurerm_subnet" "abs_snet" {
      + address_prefixes                               = [
          + "10.0.100.160/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-hub-core-prod-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-prod-vnet"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet.default_snet will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.0.100.128/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-hub-core-prod-snet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "ampe-eus-hub-core-prod-rg"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ampe-eus-hub-core-prod-vnet"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet.fw_client_snet[0] will be created
  + resource "azurerm_subnet" "fw_client_snet" {
      + address_prefixes                               = [
          + "10.0.100.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "ampe-eus-hub-core-prod-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-prod-vnet"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet.fw_management_snet[0] will be created
  + resource "azurerm_subnet" "fw_management_snet" {
      + address_prefixes                               = [
          + "10.0.100.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "ampe-eus-hub-core-prod-rg"
      + virtual_network_name                           = "ampe-eus-hub-core-prod-vnet"
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet_network_security_group_association.nsgassoc will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_subnet_route_table_association.rtassoc will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.100.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-hub-core-prod-vnet"
      + resource_group_name = "ampe-eus-hub-core-prod-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "ResourceName" = "ampe-eus-hub-core-prod-vnet"
        }
    }

  # module.landing_zone.module.mod_hub_network.random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.landing_zone.module.mod_hub_network.random_id.uniqueString will be created
  + resource "random_id" "uniqueString" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "org_prefix" = "ampe"
          + "subid"      = "hub-core"
        }
    }

  # module.landing_zone.module.mod_hub_network.random_string.str will be created
  + resource "random_string" "str" {
      + id          = (known after apply)
      + keepers     = {
          + "domain_name_label" = ""
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.landing_zone.module.mod_operational_logging.data.azurenoopsutils_resource_name.logging_st will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "logging_st" {
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.landing_zone.module.mod_operational_logging.data.azurerm_log_analytics_workspace.logws will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_log_analytics_workspace" "logws" {
      + daily_quota_gb       = (known after apply)
      + id                   = (known after apply)
      + location             = (known after apply)
      + name                 = "ampe-eus-ops-logging-core-prod-log"
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = "ampe-eus-ops-logging-core-prod-rg"
      + retention_in_days    = (known after apply)
      + secondary_shared_key = (sensitive value)
      + sku                  = (known after apply)
      + tags                 = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_log_analytics_solution.loganalytics_sentinel[0] will be created
  + resource "azurerm_log_analytics_solution" "loganalytics_sentinel" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "ampe-eus-ops-logging-core-prod-rg"
      + solution_name         = "SecurityInsights"
      + tags                  = {
          + "ResourceName" = "ampe-eus-ops-logging-core-prod-log"
        }
      + workspace_name        = "ampe-eus-ops-logging-core-prod-log"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_log_analytics_workspace.loganalytics will be created
  + resource "azurerm_log_analytics_workspace" "loganalytics" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "eastus"
      + name                               = "ampe-eus-ops-logging-core-prod-log"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "ampe-eus-ops-logging-core-prod-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "ResourceName" = "ampe-eus-ops-logging-core-prod-log"
        }
      + workspace_id                       = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_monitor_private_link_scope.global_pls will be created
  + resource "azurerm_monitor_private_link_scope" "global_pls" {
      + id                  = (known after apply)
      + name                = (known after apply)
      + resource_group_name = "ampe-eus-ops-logging-core-prod-rg"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_monitor_private_link_scoped_service.laws_pls will be created
  + resource "azurerm_monitor_private_link_scoped_service" "laws_pls" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = (known after apply)
      + resource_group_name = "ampe-eus-ops-logging-core-prod-rg"
      + scope_name          = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_private_endpoint.subnet_private_endpoint will be created
  + resource "azurerm_private_endpoint" "subnet_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ampe-eus-ops-logging-core-prod-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "deployedBy" = "AzureNoOpsTF"
          + "env"        = "prod"
          + "workload"   = "ops-logging-core"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = (known after apply)
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "azuremonitor",
            ]
        }
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_contact.main will be created
  + resource "azurerm_security_center_contact" "main" {
      + alert_notifications = true
      + alerts_to_admins    = true
      + email               = "john.doe@microsoft.com"
      + id                  = (known after apply)
      + name                = "default1"
      + phone               = "5555555555"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["AppServices"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "AppServices"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["Arm"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "Arm"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["ContainerRegistry"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "ContainerRegistry"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["Containers"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "Containers"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["Dns"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "Dns"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["KeyVaults"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "KeyVaults"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["KubernetesService"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "KubernetesService"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["OpenSourceRelationalDatabases"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "OpenSourceRelationalDatabases"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["SqlServerVirtualMachines"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "SqlServerVirtualMachines"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["SqlServers"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "SqlServers"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "StorageAccounts"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be created
  + resource "azurerm_security_center_subscription_pricing" "main" {
      + id            = (known after apply)
      + resource_type = "VirtualMachines"
      + tier          = "Standard"
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_workspace.main will be created
  + resource "azurerm_security_center_workspace" "main" {
      + id           = (known after apply)
      + scope        = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d"
      + workspace_id = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_storage_account.loganalytics_sa will be created
  + resource "azurerm_storage_account" "loganalytics_sa" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "*******"
      + resource_group_name               = "ampe-eus-ops-logging-core-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "*******"
      + tags                              = (known after apply)
    }

  # module.landing_zone.module.mod_operational_logging.random_id.uniqueString will be created
  + resource "random_id" "uniqueString" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "org_prefix" = "ampe"
          + "subid"      = "ops-logging-core"
        }
    }

  # module.landing_zone.module.mod_ops_network.data.azurenoopsutils_resource_name.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "ops-core"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.landing_zone.module.mod_ops_network.data.azurenoopsutils_resource_name.rt will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "rt" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "ops-core"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_route_table"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.landing_zone.module.mod_ops_network.data.azurenoopsutils_resource_name.snet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "ops-core"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.landing_zone.module.mod_ops_network.data.azurenoopsutils_resource_name.st will be read during apply
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #20](https://github.com/AFMPE/mpe_management/actions/runs/4756693636)